Торговля_PostgreSQL.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/ПС_ОбработкаДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_ОбработкаДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Распознан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Найден</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прикреплен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИзвлеченныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизиты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ПС_ТипыРаспознанныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_PostgreSQL.ПотоковоеСканирование/src/InformationRegisters/ПС_ОбработкаДокументов/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершенаПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	Если Запись.НаКлиенте Тогда
		
		ЗапуститьПриложение(Запись.ИмяФайла);
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Файл хранится на сервере, в данный момент функция открытия такого файла недоступна";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИПрикрепить(Команда)
	
	Если Запись.НаКлиенте Тогда
				
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Запись.ИмяФайла));
				
	Иначе
				
		АдресХранилища = "";
				
	КонецЕсли;	
	
	ПодтвердитьИПрикрепитьНаСервере(АдресХранилища);
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидимостьКнопкиПодтвердить()

	Элементы.ПодтвердитьИПрикрепить.Видимость = НЕ Запись.Объект.Пустая() И (НЕ Запись.Прикреплен ИЛИ НЕ Запись.ОбработкаЗавершена);
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьИПрикрепитьНаСервере(АдресХранилища)
	
	ПС_ИндексацияФайловВызовСервера.ПрикрепитьСканДокументаНаСервере(Запись, АдресХранилища);
	
	Если Запись.Прикреплен Тогда
		
		Записать();
		
		ПС_ИндексацияФайловВызовСервера.ЗавершитьОбработкуДокументаНаСервере(Запись);
		
		Если Запись.ОбработкаЗавершена Тогда
		
			Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
